cmsis-svd/cmsis-svd/data/Microchip/ATSAME51J.svd
               <register>
                  <name>DPLLCTRLB</name>
                  <description>DPLL Control B</description>
                  <addressOffset>0x8</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000020</resetValue>
                  <fields>
                     <field>
                        <name>FILTER</name>
                        <description>Proportional Integral Filter Selection</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                        <enumeratedValues>
                           <name>FILTERSelect</name>
                           <enumeratedValue>
                              <name>FILTER1</name>
                              <description>Bandwidth = 92.7Khz and Damping Factor = 0.76</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FILTER2</name>
                              <description>Bandwidth = 131Khz and Damping Factor = 1.08</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FILTER3</name>
                              <description>Bandwidth = 46.4Khz and Damping Factor = 0.38</description>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FILTER4</name>
                              <description>Bandwidth = 65.6Khz and Damping Factor = 0.54</description>
                              <value>3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FILTER5</name>
                              <description>Bandwidth = 131Khz and Damping Factor = 0.56</description>
                              <value>4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FILTER6</name>
                              <description>Bandwidth = 185Khz and Damping Factor = 0.79</description>
                              <value>5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FILTER7</name>
                              <description>Bandwidth = 65.6Khz and Damping Factor = 0.28</description>
                              <value>6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FILTER8</name>
                              <description>Bandwidth = 92.7Khz and Damping Factor = 0.39</description>
                              <value>7</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FILTER9</name>
                              <description>Bandwidth = 46.4Khz and Damping Factor = 1.49</description>
                              <value>8</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FILTER10</name>
                              <description>Bandwidth = 65.6Khz and Damping Factor = 2.11</description>
                              <value>9</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FILTER11</name>
                              <description>Bandwidth = 23.2Khz and Damping Factor = 0.75</description>
                              <value>10</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FILTER12</name>
                              <description>Bandwidth = 32.8Khz and Damping Factor = 1.06</description>
                              <value>11</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FILTER13</name>
                              <description>Bandwidth = 65.6Khz and Damping Factor = 1.07</description>
                              <value>12</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FILTER14</name>
                              <description>Bandwidth = 92.7Khz and Damping Factor = 1.51</description>
                              <value>13</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FILTER15</name>
                              <description>Bandwidth = 32.8Khz and Damping Factor = 0.53</description>
                              <value>14</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FILTER16</name>
                              <description>Bandwidth = 46.4Khz and Damping Factor = 0.75</description>
                              <value>15</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>WUF</name>
                        <description>Wake Up Fast</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>REFCLK</name>
                        <description>Reference Clock Selection</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>REFCLKSelect</name>
                           <enumeratedValue>
                              <name>GCLK</name>
                              <description>Dedicated GCLK clock reference</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>XOSC32</name>
                              <description>XOSC32K clock reference</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>XOSC0</name>
                              <description>XOSC0 clock reference</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>XOSC1</name>
                              <description>XOSC1 clock reference</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>LTIME</name>
                        <description>Lock Time</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>LTIMESelect</name>
                           <enumeratedValue>
                              <name>DEFAULT</name>
                              <description>No time-out. Automatic lock</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>800US</name>
                              <description>Time-out if no lock within 800us</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>900US</name>
                              <description>Time-out if no lock within 900us</description>
                              <value>0x5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>1MS</name>
                              <description>Time-out if no lock within 1ms</description>
                              <value>0x6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>1P1MS</name>
                              <description>Time-out if no lock within 1.1ms</description>
                              <value>0x7</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>LBYPASS</name>
                        <description>Lock Bypass</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DCOFILTER</name>
                        <description>Sigma-Delta DCO Filter Selection</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>DCOFILTERSelect</name>
                           <enumeratedValue>
                              <name>FILTER1</name>
                              <description>Capacitor(pF) = 0.5 and Bandwidth Fn (MHz) = 3.21</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FILTER2</name>
                              <description>Capacitor(pF) = 1 and Bandwidth Fn (MHz) = 1.6</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FILTER3</name>
                              <description>Capacitor(pF) = 1.5 and Bandwidth Fn (MHz) = 1.1</description>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FILTER4</name>
                              <description>Capacitor(pF) = 2 and Bandwidth Fn (MHz) = 0.8</description>
                              <value>3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FILTER5</name>
                              <description>Capacitor(pF) = 2.5 and Bandwidth Fn (MHz) = 0.64</description>
                              <value>4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FILTER6</name>
                              <description>Capacitor(pF) = 3 and Bandwidth Fn (MHz) = 0.55</description>
                              <value>5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FILTER7</name>
                              <description>Capacitor(pF) = 3.5 and Bandwidth Fn (MHz) = 0.45</description>
                              <value>6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FILTER8</name>
                              <description>Capacitor(pF) = 4 and Bandwidth Fn (MHz) = 0.4</description>
                              <value>7</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DCOEN</name>
                        <description>DCO Filter Enable</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIV</name>
                        <description>Clock Divider</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>11</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DPLLSYNCBUSY</name>
                  <description>DPLL Synchronization Busy</description>
                  <addressOffset>0xC</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>ENABLE</name>
                        <description>DPLL Enable Synchronization Status</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DPLLRATIO</name>
                        <description>DPLL Loop Divider Ratio Synchronization Status</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DPLLSTATUS</name>
                  <description>DPLL Status</description>
                  <addressOffset>0x10</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>LOCK</name>
                        <description>DPLL Lock Status</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CLKRDY</name>
                        <description>DPLL Clock Ready</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
